from sitkva.models import *
from sitkva import db



streets = [

"ა. კათალიკოსის ჩიხი,"
,"აბესაძის ქ."
,"აბო თბილელის ქ."
,"აბოვიანის ქ."
,"ავლევის შეს."
,"ათონელის ქ."
,"აკოფიანის ქ."
,"ამაღლების ქ."
,"ასკანის ქ."
,"ახოსპირელის ქ."
,"ბამბის რიგი,"
,"ბეთლემის ქ."
,"ბნელი ჩიხი,"
,"ბოტანიკურის ქ."
,"გ.ტაბიძის ქ."
,"გერგეთის ქ."
,"გოგჩის ქ."
,"გომის ქ."
,"გრ.ხანძთელის ქ."
,"დაბახანის ქ."
,"დიუმას ქ."
,"დუტუ მეგრელის ქ."
,"ერეკლე II-ის ქ."
,"ვერცხლის ქ."
,"თუმანიანის ქ."
,"იაშვილის ქ."
,"იეთიმ გურჯის ქ."
,"იერუსალიმის ქ."
,"ივერიის ქ."
,"ირგვლივის შეს."
,"კ.ცინცაძის ქ."
,"კოტე აფხაზის ქ."
,"კუფტინის ქ."
,"ლ. ასათიანის ქ."
,"ლეონიძის ქ."
,"ლერმონტოვის ქ."
,"მაჩაბლის ქ."
,"მტკვრის ქ."
,"ნაკაშიძეების ქ."
,"ონის ქ."
,"ორპირის ქ."
,"ოქრომჭედლების ქ."
,"პუშკინის ქ."
,"რკინის რიგი შეს."
,"საადის ქ."
,"საიათნოვას ქ."
,"სალამის ქ."
,"სამღებროს ქ,"
,"სიონის ქ."
,"სობჩაკის ქ."
,"სოლოლაკის ხეივანი,"
,"სულთნიშანის ქ."
,"სულხანიშვილის ქ."
,"სულხან-საბას ქ."
,"ტელეგრაფის ჩიხი,"
,"ფეთხაინის აღმ."
,"ქიქოძის ქ."
,"ყავლაშვილის ქ."
,"შ.დადიანის ქ."
,"შავთელის ქ."
,"შარდენის ქ."
,"ჩახრუხაძის ქ."
,"ხოდაშენის ქ."
,"ჯიბლაძის ქ."

]



j = 1

for i in streets:
    sd = Street(id = 5900+j, name = i,subdistrict_id = 506)
    j += 1
    db.session.add(sd)
    db.session.commit()
